#include <stdio.h>

/**
 * 名古屋大学　大学院情報学研究科　2014年度博士前期課程入試問題　情1-1
 *
 * ---問題---
 * 次のプログラムの出力結果を示せ
 */
int main(void)
{
    /**
     *     Hex | Dec
     * 0x1234  | 4 * 1 + 3 * 16 + 2 * 16^2 + 1 * 16^3 = 4 + 48 + 512 + 4096 = 560 + 4100 = 4660
     * 
     * 0001 0010 0011 0100
     * 1100 0011 1100 0011
     * & 
     * 0000 0010 0000 0000 === 0x0200
     * 
     * 0001 0010 0011 0100 << 2 => 0100 1000 1101 0000
    */
    int a = 0x1234;
    printf("%x %d %x %x %x\n", a, a, a + 10, a & 0xc3c3, a << 2); // 1234, 4660, 0x123e, 200,  48d0
    return 0;
}