#include <stdio.h>

/**
 * 名古屋大学　大学院情報学研究科　2011年度博士前期課程入試問題　情1-1
 *
 * ---問題---
 * 次のプログラムの演算結果を求めよ
 */
int main(void)
{
    int a = 0x1234, b = 0xabcd;
    /**
     * 0x1234 = 0001 0010 0011 0100
     * 0xabcd = 1010 1011 1100 1101
     * 
     * 0x1234 & 0xabcd => 0000 0010 0000 0100 === 0x0204 => 204
     * 
     * 0x1234 | 0xabcd => 1011 1011 1111 1101 === 0xbbff => bbfd
     * 
     * 0x1234 ^ 0xabcd => 1011 1001 1111 1001 === 0xb9f9 => b9f9
     * 
     * 0xabcd >> 3 =>   1010 1011 1100 1101
     *                  0001 0101 0111 1001 === 0x1579 => 1579
    */
    printf("  %x\n  %x\n  %x\n  %x\n", a & b, a | b, a ^ b, b >> 3);
    return 0;
}
