#include <stdio.h>

/**
 * 名古屋大学　大学院情報学研究科　2019年度博士前期課程入試問題　情1−１
 *
 * ---問題---
 * 次のプログラムの出力結果を示せ
 */
int main()
{
    /**
     * Hex | Dec
     * 0X0f0f => 15 * 16^0 + 15 * 16^2 = 15 + 15 * 256 = 15 + 2560 + 1024 + 256 = 15 + 3840 = 3855
     */
    int a = 0X0f0f;
    printf("%d\n", a);     // 3855
    printf("%x\n", a % 2); // 3855 % 2 = 1 => 0x1;
    /**
     * 0X0f0f = 0000 1111 0000 1111
     * 0X2468 = 0010 0100 0110 1000
     *
     * 0X0f0f & 0X2468 = 0000 0100 0000 0100 => 0x0408
     */
    printf("%x\n", a & 0X2468); // 0x0408
    /**
     * Method One:
     * 3855 * 4 = 15420 => 11110000111100
     * 0011 1100 0011 1100
     * 
     * Method Two:
     * 0x0f0f === 0000 1111 0000 1111 => 0011 1100 0011 1100 => 3c3c
     */

    printf("%x\n", a << 2);
    return 0;
}