#include <stdio.h>

/**
 * 名古屋大学　大学院情報学研究科　2017年度博士前期課程入試問題　情1−１
 *
 * ---問題---
 * 次のC言語プログラムの標準出力への出力結果を示せ。
 */

int main(void)
{
    int a = 0xf0f0, b = 0x9876;
    char s[] = "Nagoya_Univ";

    /**
     * Hex | Dec
     * 0xf0f0 => 15 * 16^1 + 15 * 16 ^ 3 = 240 + 4096 * 15 = 240 + 61440 = 61680
     *
     */
    printf("%d\n", a);      // 61680
    printf("%x\n", a << 2); // 1111 0000 1111 0000 => 0011 1100 0011 1100 0000 => 0x3c3c0
    // 1111 0000 1111 0000
    // 1001 1000 0111 0110
    // a | b => 1111 1000 1111 0110 => 0xf8f6 => 6 * 1 + 15 * 16 + 8 * 16^2 + 15 * 16^3 = 6 + 240 + 2048 + 61440 = 63734
    printf("%d\n", a | b);
    // 1111 0000 1111 0000
    // 1001 1000 0111 0110
    // a ^ b =>  0110 1000 1000 0110 => 0x6886
    printf("%x\n", a ^ b);
    printf("%c\n", s[7]); // U
    return 0;
}