#include <stdio.h>

/**
 * 名古屋大学　大学院情報学研究科　2018年度博士前期課程入試問題　情1−１
 *
 * ---問題---
 * 次のプログラムの出力結果を示せ
 */
int main(void)
{
    int a = 0x456;
    int b = 0x0ff;

    /**
     * Hex | Dec
     * 0x456 => 6 * 1 + 5 * 16 + 4 * 256 = 6 + 80 + 1024 = 1110
     * 0x0ff => 15 * 1 + 15 * 16 = 15 + 240 = 255
     *
     * 0x456 === 0000 0100 0101 0110
     * 0x0ff === 0000 0000 1111 1111
     *
     * 0x456 | 0x0ff => 0000 0100 1111 1111 = 0x04ff = 15 * 1 + 15 * 16 + 4 * 16^2 = 15 + 240 + 1024 = 1279
     */
    printf("%x\n", a);     // 0x456 | 456
    printf("%d\n", b);     // 255
    printf("%d\n", a | b); // 1279
    printf("%x\n", b >> 1); // 255 / 2 === 127 === 0111 1111 === 0x7f

    return 0;
}